#Библиотека Pandas

#Data Frame

In [2]:
import pandas as pd

ValueError: numpy.dtype has the wrong size, try recompiling. Expected 88, got 96

In [5]:
x = 5
print (x)

5

In [6]:
e = 1
print(e)

1

In [7]:
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [8]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [9]:
frame.columns

Index(['chars', 'numbers'], dtype='object')

In [10]:
frame.shape

(10, 2)

In [11]:
new_line = {'chars': 'b', 'numbers': 10, 'numbers': 7,  'numbers': 5}

In [12]:
frame.append(new_line, ignore_index = True)

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     b        5

In [13]:
frame = frame.append(new_line, ignore_index = True)

In [14]:
frame

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     b        5

In [15]:
frame['IsStudent'] = [False]*10 + [True]*3

ValueError: Length of values does not match length of index

In [16]:
frame

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     b        5

In [17]:
frame.drop([10,11,12], axis = 0, inplace = True)

ValueError: labels [11 12] not contained in axis

In [18]:
frame

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     b        5

In [19]:
frame.drop('IsStudent', axis = 1, inplace=True)

ValueError: labels ['IsStudent'] not contained in axis

In [20]:
frame

   chars  numbers
0      a        0
1      a        1
2      a        2
3      a        3
4      a        4
5      a        5
6      a        6
7      a        7
8      a        8
9      a        9
10     b        5

In [21]:
frame.to_csv('updated_datset.csv', sep = ',',header=True, index = None)

In [22]:
!cat updated_datset.csv

chars,numbers
a,0
a,1
a,2
a,3
a,4
a,5
a,6
a,7
a,8
a,9
b,5

In [23]:
frame = pd.read_csv('dataset.tsv', header = 0, sep = '\t')

In [24]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [25]:
frame = pd.read_csv('dataset.tsv', sep = '\t', header = 0)

In [26]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [27]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [28]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [29]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [30]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [31]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 272.0+ bytes

In [32]:
frame.fillna('разнорабочий', inplace = True)

In [12]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [13]:
frame.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [16]:
frame[['Position', 'Name']]

       Position             Name
0  разнорабочий      Иванов А.А.
1       инженер     Сорокин И.В.
2      менеджер       Белов М.М.
3  разнорабочий  Мельникова Д.С.
4       инженер      Рыбина Е.П.
5        стажер     Костров С.О.

In [17]:
frame.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [18]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [19]:
frame.loc[[1,3,5], ['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [22]:
frame.iloc[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [25]:
frame.ix[[1,3,5],['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [5]:
frame.ix[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [10]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [13]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City Position
3  Мельникова Д.С. 1985-04-15  Ростов      NaN
4      Рыбина Е.П. 1985-11-19  Москва  инженер
5     Костров С.О. 1985-05-31  Москва   стажер

In [16]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий

In [20]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) | (frame.City == 'Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [23]:
frame.shape

(6, 4)

In [24]:
frame['IsStudent'] = (False, True, True, True, True, False)

In [30]:
frame['IsStudent'] = [False, True, True, True, True, False]

In [31]:
frame

              Name      Birth       City      Position IsStudent
0      Иванов А.А. 1980-03-22     Москва  разнорабочий     False
1     Сорокин И.В. 1965-07-08  Волгоград       инженер      True
2       Белов М.М. 1980-02-13     Ростов      менеджер      True
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий      True
4      Рыбина Е.П. 1985-11-19     Москва       инженер      True
5     Костров С.О. 1985-05-31     Москва        стажер     False

In [32]:
frame['IsStudent'] = False, True, True, True, True, False